[
  {
    "title": "Відповідає за наповнення веб-сторінки контентом, структуру і зміст:",
    "variants": ["HTML", "CSS", "JavaScript"],
    "correct": 0
  },
  {
    "title": "Як називаються найменші будівельні блоки, з яких складається будь-яка веб-сторінка?",
    "variants": ["атрибути", "теги"],
    "correct": 1
  },
  {
    "title": "Чи є тег img парним?",
    "variants": ["Так", "Ні"],
    "correct": 1
  },
  {
    "title": "Який тег призначений для зберігання службової інформації про сторінку: заголовок, опис, кодування тощо?",
    "variants": ["html", "body", "head"],
    "correct": 2
  },
  {
    "title": "Займає повністю увесь рядок, незалежно від обсягу його контенту:",
    "variants": ["inline element", "block-level element"],
    "correct": 1
  },
  {
    "title": "Великі файли, що не потребують прозорого фону або анімації",
    "variants": ["JPEG", "PNG", "webP"],
    "correct": 0
  },
  {
    "title": "Який тег використовують для фінальної частинини всієї сторінки, її розділу або статті. Часто містить копірайт, список посилань на соціальні мережі, контактну інформацію і таке інше. Може бути кілька на сторінці.?",
    "variants": ["main", "header", "footer"],
    "correct": 2
  },
  {
    "title": "Для якого псевдокласу вірним є опис: активується, коли інтерактивний елемент (посилання, кнопка, поле форми) отримує фокус під час навігації по сторінці клавіатурою (клавішею Tab)?",
    "variants": [":focus", ":hover", ":active"],
    "correct": 0
  },
  {
    "title": "Яка властивість задає різні декоративні підкреслення та інші ефекти тексту?",
    "variants": ["text-decoration", "text-transform", "text-align"],
    "correct": 0
  },
  {
    "title": "Який тип блокової моделі використовується в браузерах за замовчуванням?",
    "variants": ["border-box", "content-box"],
    "correct": 1
  },
  {
    "title": "Збірна властивість контролює зовнішні відступи від рамки для всіх сторін елемента:",
    "variants": ["margin", "border", "padding"],
    "correct": 0
  },
  {
    "title": "Яка властивість flexbox встановлює напрямок головної осі, визначаючи напрямок елементів в контейнері: ",
    "variants": ["align-items", "flex-wrap", "flex-direction"],
    "correct": 2
  },
  {
    "title": "Що відбудеться з елементами при justify-content: space-between",
    "variants": [
      "елементи рівномірно розподіляться на головній осі",
      "елементи притиснуться до кінця осі",
      "елементи розподіляються рівномірно, але лівий і правий елемент відстають від меж контейнера на половину проміжку між іншими елементами"
    ],
    "correct": 0
  },
  {
    "title": "Як називаються зображення, які несуть смислове навантаження, належать до змісту сторінки і допомагають донести до користувача корисну для нього інформацію?",
    "variants": ["Декоративні зображення", "Контентні зображення", "Растрові зображення"],
    "correct": 1
  },
  {
    "title": "Який вид позиціонування використовується для закріплених хедерів з навігацією, спливаючих вікон, чатів з менеджером на сторінках інтернет-магазинів тощо?",
    "variants": ["sticky position", "absolute position", "fixed position"],
    "correct": 2
  },
  {
    "title": "Якому типу версти відповідає опис: Має кілька варіантів відображення, переходи між ними плавні, елементи і контейнер тягнуться як гумові:",
    "variants": ["responsive", "adaptive"],
    "correct": 0
  }
]
